In [9]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
"""
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
"""

'\nQ1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.\n'

In [14]:
ser = pd.Series([4, 8, 15, 16, 23, 42])

In [15]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [16]:
"""
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
"""

'\nQ2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the\nvariable print it.\n'

In [17]:
l1 = [4, 8, 15, 16, 23, 42, "ss", "rr", 34.23, 35]
ser1 = pd.Series(l1)

In [18]:
ser1

0        4
1        8
2       15
3       16
4       23
5       42
6       ss
7       rr
8    34.23
9       35
dtype: object

In [19]:
"""
Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.
"""

'\nQ3. Create a Pandas DataFrame that contains the following data:\n\nThen, print the DataFrame.\n'

In [24]:
d = {'Name': ["Alice", "Bob", "Claire"], 'Age': [25, 30, 27], 'Gender': ["Female", "Male", "Female"]}

In [25]:
df = pd.DataFrame(data=d)

In [26]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [28]:
"""
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
"""

'\nQ4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.\n'

In [29]:
"""
Pandas Series:
one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and 
values are the values stored on that index.

DataFrame:
two-dimensional data structure that can be thought of as a spreadsheet. 
It can also be thought of as a collection of two or more series with common indices.

"""

'\nPandas Series:\none-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and \nvalues are the values stored on that index.\n\nDataFrame:\ntwo-dimensional data structure that can be thought of as a spreadsheet. \nIt can also be thought of as a collection of two or more series with common indices.\n\n'

In [30]:
"""
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
"""

'\nQ5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can\nyou give an example of when you might use one of these functions?\n'

In [32]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [33]:
df = pd.read_csv('services.csv')

In [34]:
df.tail(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [35]:
df['service_areas']

0                                     Colma
1                          San Mateo County
2                          San Mateo County
3                          San Mateo County
4                          San Mateo County
5                          San Mateo County
6       Belmont, Burlingame, East Palo Alto
7                   Belmont, East Palo Alto
8                          San Mateo County
9                          San Mateo County
10                         San Mateo County
11                                Daly City
12                         San Mateo County
13      Belmont, Burlingame, East Palo Alto
14         Alameda County, San Mateo County
15                                      NaN
16    Colma, Daly City, South San Francisco
17                           East Palo Alto
18                      Belmont, Burlingame
19                                      NaN
20                         San Mateo County
21         Alameda County, San Mateo County
22         San Mateo County, Alameda County
Name: service_areas, dtype: object

In [36]:
df.columns

Index(['id', 'location_id', 'program_id', 'accepted_payments',
       'alternate_name', 'application_process', 'audience', 'description',
       'eligibility', 'email', 'fees', 'funding_sources',
       'interpretation_services', 'keywords', 'languages', 'name',
       'required_documents', 'service_areas', 'status', 'wait_time', 'website',
       'taxonomy_ids'],
      dtype='object')

In [37]:
df[['location_id', 'program_id', 'accepted_payments']]

    location_id  program_id         accepted_payments
0             1         NaN                       NaN
1             2         NaN                       NaN
2             3         NaN                       NaN
3             4         NaN                       NaN
4             5         NaN                       NaN
5             6         NaN                       NaN
6             7         NaN                       NaN
7             8         NaN                       NaN
8             9         NaN                       NaN
9            10         NaN                       NaN
10           11         NaN                       NaN
11           12         NaN                       NaN
12           13         NaN                       NaN
13           14         NaN                       NaN
14           15         NaN                       NaN
15           16         NaN                       NaN
16           17         NaN                       NaN
17           18         NaN                       NaN
18           19         NaN                       NaN
19           20         NaN                       NaN
20           21         NaN                       NaN
21           22         NaN  Cash, Check, Credit Card
22           22         NaN                       NaN

In [38]:
type(df['service_areas'])

pandas.core.series.Series

In [39]:
list(df['service_areas'])

['Colma',
 'San Mateo County',
 'San Mateo County',
 'San Mateo County',
 'San Mateo County',
 'San Mateo County',
 'Belmont, Burlingame, East Palo Alto',
 'Belmont, East Palo Alto',
 'San Mateo County',
 'San Mateo County',
 'San Mateo County',
 'Daly City',
 'San Mateo County',
 'Belmont, Burlingame, East Palo Alto',
 'Alameda County, San Mateo County',
 nan,
 'Colma, Daly City, South San Francisco',
 'East Palo Alto',
 'Belmont, Burlingame',
 nan,
 'San Mateo County',
 'Alameda County, San Mateo County',
 'San Mateo County, Alameda County']

In [40]:
"""
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
"""

"""
All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. 
Series is size immutable.

DataFrame is widely used and one of the most important data structures. Panel is used much less.
"""

'\nAll Pandas data structures are value mutable (can be changed) and except Series all are size mutable. \nSeries is size immutable.\n\nDataFrame is widely used and one of the most important data structures. Panel is used much less.\n'

In [41]:
"""
Q7. Create a DataFrame using multiple Series. Explain with an example.
"""

'\nQ7. Create a DataFrame using multiple Series. Explain with an example.\n'

In [45]:
l2 = [4, 8, 15, 16, 23, 42]
ser1 = pd.Series(l2)

l3 = ["ss", "rr", 34.23, 35]
ser2 = pd.Series(l3)

In [46]:
da = {"col1": ser1, "col2": ser2}

In [47]:
df = pd.DataFrame(data=da)

In [48]:
df

   col1   col2
0     4     ss
1     8     rr
2    15  34.23
3    16     35
4    23    NaN
5    42    NaN